> About to be released in 1.3.0.

@alesstimec I attempted to test this on the v1.3.0-rc1 branch, but it looks like the `bootstrap_constraints` aren't applying properly for my resource

resource plan here, but mainly interested in the `bootstrap_constraints`.

```bash
  # module.juju_controller_36_production_et3.juju_controller.controller will be created
  + resource "juju_controller" "controller" {
      + agent_version         = "3.6.14"
      + api_addresses         = (known after apply)
      + bootstrap_base        = "ubuntu@24.04"
      + bootstrap_constraints = {
          + "cores"            = "4"
          + "mem"              = "16G"
          + "root-disk"        = "100G"
          + "root-disk-source" = "remote"
          + "virt-type"        = "virtual-machine"
        }
      + ca_cert               = (known after apply)
      + cloud                 = {
          + auth_types = [
              + "certificate",
            ]
          + name       = "microcloud-et3"
          + type       = "lxd"
        }
      + cloud_credential      = (sensitive value)
      + controller_config     = {
          + "allow-model-access" = "true"
          + "public-dns-address" = "juju-controller-36-production-et3.dynamic.admin.canonical.com:17070"
        }
      + controller_uuid       = (known after apply)
      + id                    = (known after apply)
      + juju_binary           = "/snap/juju/current/bin/juju"
      + name                  = "juju-controller-36-production-et3"
      + password              = (sensitive value)
      + username              = (known after apply)
    }
```

This produces an error:
```bash
│ Error: Bootstrap Error
│ 
│   with module.juju_controller_36_production_et3.juju_controller.controller,
│   on .terraform/modules/juju_controller_36_production_et3/microcloud/juju_controller/main.tf line 34, in resource "juju_controller" "controller":
│   34: resource "juju_controller" "controller" {
│ 
│ Unable to bootstrap controller "juju-controller-36-production-et3", got error: bootstrap failed: command failed (see log file
│ /tmp/juju-bootstrap-log-3736884820.txt): exit status 2
╵

# in the log file:
=== Executing: /snap/juju/current/bin/juju update-public-clouds --client ===
Fetching latest public cloud list...
Updated list of public clouds on this client, 2 cloud attributes changed:

    changed cloud attribute:
        - azure-china
        - google

=== Executing: /snap/juju/current/bin/juju bootstrap --agent-version=3.6.14 --bootstrap-base=ubuntu@24.04 --bootstrap-constraints cores=4 --bootstrap-constraints mem=16G --bootstrap-constraints root-disk-source=remote --bootstrap-constraints root-disk=100G --bootstrap-constraints virt-type=virtual-machine --config /tmp/juju-bootstrap-2135815167/bootstrap-config.yaml microcloud-et3 juju-controller-36-production-et3 ===
ERROR option provided but not defined: --bootstrap-constraints cores
```

I think the `bootstrap_constraints` resource should not be split into several individual k:v pairs. Per an example I found on the [juju docs](https://documentation.ubuntu.com/juju/3.6/howto/manage-controllers/), it looks like it should be passed as  a single parameter, with spaces between the k:v pairs. E.g. `--bootstrap-constraints "root-disk=50G cores=2  mem=4G"`.

This looks consistent with the field from the schema on this issue `bootstrap_constraints = "<bootstrap machine constraints>"` (not a map)

edit: I don't see a PR related to this one. Let me know if this is better as a separate issue